# Series

In [1]:
import numpy as np
import pandas as pd

In [2]:
labels = ['a', 'b', 'c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a': 10, 'b': 20, 'c': 30}

In [3]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(data = my_data, index = labels)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int32

In [7]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [8]:
ser1 = pd.Series([1,2,3], ['One', 'Two', 'Three'])

In [9]:
ser1

One      1
Two      2
Three    3
dtype: int64

# Data frames

In [10]:
import pandas as pd
import numpy as np
from numpy.random import randn

In [11]:
np.random.seed(101)

In [12]:
df = pd.DataFrame(randn(5,4), ['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])

In [13]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [14]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [15]:
df[['W', 'Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [17]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [18]:
df.loc['B']

W    0.651118
X   -0.319318
Y   -0.848077
Z    0.605965
Name: B, dtype: float64

In [19]:
df.loc[['A', 'B'], ['W', 'Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [20]:
np.random.seed(101)
df = pd.DataFrame(randn(5,4), ['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])

In [21]:
booldf = df > 0
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [22]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [33]:
df['state'] = "CA, WS, SF, LA, LV".split(", ")

In [35]:
df.set_index('state') # Set new index based on the current column

              W         X         Y         Z
state
CA     2.706850  0.628133  0.907969  0.503826
WS     0.651118 -0.319318 -0.848077  0.605965
SF    -2.018168  0.740122  0.528813 -0.589001
LA     0.188695 -0.758872 -0.933237  0.955057
LV     0.190794  1.978757  2.605967  0.683509

In [12]:
import pandas as pd
import numpy as np
from numpy.random import randn

In [10]:
# Index levels

outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1, 2, 3, 1, 2, 3]
hier_index = list(zip(outside, inside)) # Make lists to a list of tuple pairs
hier_index = pd.MultiIndex.from_tuples(hier_index) # Make index hierarchy

In [13]:
df = pd.DataFrame(randn(6,2), hier_index, ['A','B'])

In [14]:
df

             A         B
G1 1  0.880859  1.131751
   2 -0.880459  0.393518
   3 -0.131651  0.687975
G2 1 -0.049943  0.743326
   2 -0.180842 -1.219138
   3 -0.617496  0.379953

In [18]:
df.index.names = ['Groups', 'Num']

In [19]:
df

                   A         B
Groups Num
G1     1    0.880859  1.131751
       2   -0.880459  0.393518
       3   -0.131651  0.687975
G2     1   -0.049943  0.743326
       2   -0.180842 -1.219138
       3   -0.617496  0.379953

In [20]:
df.xs('G1')

            A         B
Num
1    0.880859  1.131751
2   -0.880459  0.393518
3   -0.131651  0.687975

In [21]:
df.xs(1, level = 'Num') # Select elements from all levels

               A         B
Groups
G1      0.880859  1.131751
G2     -0.049943  0.743326

# Missing data

In [22]:
import pandas as pd
import numpy as np

In [26]:
d = {'A':[1,2,np.nan], 'B':[5,np.nan,np.nan], 'C':[1,2,3]}
df = pd.DataFrame(d)

In [27]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [28]:
df.dropna(axis = 1) # Delete NaN values

   C
0  1
1  2
2  3

In [32]:
df.dropna(thresh = 1) # Thresh - limit of not-NaN values

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [33]:
df.fillna(value = 'Fill value') # Fill NaN values

            A           B  C
0           1           5  1
1           2  Fill value  2
2  Fill value  Fill value  3

In [35]:
df['A'].fillna(value = df['A'].mean()) # Fill NaN by mean value of column

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# Group By

In [36]:
data = {'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'], 
       'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
       'Sales': [200, 120, 340, 124, 243, 350]}

In [38]:
df = pd.DataFrame(data)

In [39]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [44]:
df.groupby('Company').mean().loc['FB']['Sales']

296.5

In [46]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

# Merging, Joining and Concatenating

In [58]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                   'B': ['B0', 'B1', 'B2', 'B3'],
                   'C': ['C0', 'C1', 'C2', 'C3'],
                   'D': ['D0', 'D1', 'D2', 'D3']}, 
                   index = [0, 1, 2, 3])

In [59]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                   'B': ['B4', 'B5', 'B6', 'B7'],
                   'C': ['C4', 'C5', 'C6', 'C7'],
                   'D': ['D4', 'D5', 'D6', 'D7']}, 
                   index = [4, 5, 6, 7])

In [60]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                   'B': ['B8', 'B9', 'B10', 'B11'],
                   'C': ['C8', 'C9', 'C10', 'C11'],
                   'D': ['D8', 'D9', 'D10', 'D11']}, 
                   index = [8, 9, 10 ,11])

In [61]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [62]:
# Объединение (glue) DataFrame-ов
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [63]:
pd.concat([df1,df2,df3], axis = 1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [78]:
left = df1.loc[:, ['A', 'B']]
left['key'] = ['K0', 'K1', 'K2', 'K3']

In [79]:
right = df1.loc[:, ['C', 'D']]
right['key'] = ['K0', 'K1', 'K2', 'K3']

In [80]:
right

    C   D key
0  C0  D0  K0
1  C1  D1  K1
2  C2  D2  K2
3  C3  D3  K3

In [82]:
# Обединение таблиц по столбцу (merging)

pd.merge(left, right, how = 'inner', on = 'key')

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [83]:
pd.merge(left, right, how = 'outer', on = 'key')

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [94]:
# Объединение таблиц по индексу Index Join

left = pd.DataFrame({'A': [1,2,3], 'B': [4,5,6]}, index = ['K0', 'K1', 'K2'])
right = pd.DataFrame({'C': [7,8,9], 'D': [10,11,12]}, index = ['K0', 'K1', 'K2'])

In [95]:
left.join(right)

    A  B  C   D
K0  1  4  7  10
K1  2  5  8  11
K2  3  6  9  12

# Operations

In [96]:
df = pd.DataFrame({
    'col1': [1,2,3,4],
    'col2': [444,555,666,444],
    'col3': ['abc', 'def', 'ghi', 'xyz']
})

In [97]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [99]:
len(df['col2'].unique())

3

In [100]:
df['col2'].nunique()

3

In [101]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [102]:
def times2(num):
    return num ** 2

In [104]:
df['col1'].apply(times2) # Apply function to column

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [106]:
df['col2'].apply(lambda x: x ** 2)

0    197136
1    308025
2    443556
3    197136
Name: col2, dtype: int64

In [108]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [109]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [111]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [112]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

# Data input and output

<br>
<li>CSV</li>
<li>Excel</li>
<li>HTML</li>
<li>SQL</li>

In [113]:
conda install sqlalchemy
conda install lxml
conda install html5lib
conda install BeautifulSoup4
conda install xlrd # To open excel files

Collecting package metadata: ...working... done
Solving environment: ...working... done

# All requested packages already installed.


Note: you may need to restart the kernel to use updated packages.

In [114]:
# Current files location
pwd

'C:\\Users\\perevozchikov.k\\Python crash course'

In [ ]:
pd.read_csv('file.csv')

In [ ]:
df.to_csv('My output', index = False) # Save dataframe to csv file

In [ ]:
pd.read_excel('file.xlsx', sheetname = 'Name')

In [ ]:
df.to_excel('new_file'.xlsx, sheet_name = 'New name') # Save dataframe to excel file

In [115]:
data = pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')

In [119]:
data[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","February 1, 2019"
1,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","February 21, 2018"
2,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","January 29, 2019"
3,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","March 22, 2018"
4,First NBC Bank,New Orleans,LA,58302,Whitney Bank,"April 28, 2017","January 29, 2019"

In [120]:
from sqlalchemy import create_engine

In [122]:
engine = create_engine('sqlite:///:memory:') # Create engine for sql

In [ ]:
df.to_sql('my_table', engine) # Save sql by engine

In [ ]:
sqldf = pd.read_sql('my_table', con = 'engine') # Read sql via engine

# Homework

In [63]:
import pandas as pd
import numpy as np

In [2]:
sal = pd.read_csv('Salaries.csv')

C:\Users\perevozchikov.k\AppData\Local\Continuum\anaconda\lib\site-packages\IPython\core\interactiveshell.py:3049: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [3]:
sal.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411,0,400184,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966,245132,137811,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739,106088,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916,56120.7,198307,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134402,9737,182235,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [4]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
Id                  148654 non-null int64
EmployeeName        148654 non-null object
JobTitle            148654 non-null object
BasePay             148049 non-null object
OvertimePay         148654 non-null object
OtherPay            148654 non-null object
Benefits            112495 non-null object
TotalPay            148654 non-null float64
TotalPayBenefits    148654 non-null float64
Year                148654 non-null int64
Notes               0 non-null float64
Agency              148654 non-null object
Status              38119 non-null object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

In [5]:
sal.BasePay = pd.to_numeric(sal.BasePay, errors = 'coerce')
sal.OvertimePay = pd.to_numeric(sal.OvertimePay, errors = 'coerce')

In [6]:
sal['BasePay'].mean()

66325.44884050643

In [7]:
sal['OvertimePay'].max()

245131.88

In [8]:
sal[sal['EmployeeName'] == 'JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [9]:
sal[sal['EmployeeName'] == 'JOSEPH DRISCOLL'].sum()['TotalPay']

270324.91

In [70]:
sal[sal['TotalPay'] == sal['TotalPay'].max()]['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

In [80]:
# sal.iloc[sal['TotalPayBenefits'].argmax()]
sal.loc[sal['TotalPayBenefits'].idxmax()]

Id                                                               1
EmployeeName                                        NATHANIEL FORD
JobTitle            GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY
BasePay                                                     167411
OvertimePay                                                      0
OtherPay                                                    400184
Benefits                                                       NaN
TotalPay                                                    567595
TotalPayBenefits                                            567595
Year                                                          2011
Notes                                                          NaN
Agency                                               San Francisco
Status                                                         NaN
length_of_job                                               148654
Name: 0, dtype: object

In [77]:
sal['TotalPayBenefits'].idxmin()

148653

In [11]:
sal.groupby('Year').mean()['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

In [12]:
sal['JobTitle'].nunique()

2159

In [83]:
sal2 = sal.groupby('JobTitle').count()['Id']
sal2.sort_values(ascending = False).head()

sal['JobTitle'].value_counts().head(5)

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

In [86]:
sum(sal[sal['Year'] == 2013]['JobTitle'].value_counts() == 1)

202

In [90]:
n = 0
for i in sal['JobTitle']:
    if 'Chief' in i:
        n += 1
print(n)

423

In [93]:
sal['length_of_job'] = sal['JobTitle'].apply(len)
sal.length_of_job = sal.length_of_job.astype(float)

In [100]:
sal[['length_of_job', 'TotalPay']].corr()

               length_of_job  TotalPay
length_of_job       1.000000 -0.015356
TotalPay           -0.015356  1.000000